# Motor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalLoadClassification..::..Motor Property
ElectricalLoadClassification Class See Also
---
Indicates if this load classification is to be used for motors.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool Motor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Motor As Boolean
	Get
```

Visual C++
---
```text
public:
property bool Motor {
	bool get ();
}
```

# See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace